package com.handtruth.javaschool.server.controllers;

public class Constants {

    static String kotlin_descr = "Kotlin (Ко́тлин) — статически типизированный язык программирования, " +
            "работающий поверх JVM и разрабатываемый компанией JetBrains. Также компилируется в JavaScript, " +
            "и в исполняемый код ряда платформ через инфраструктуру LLVM. Язык назван в честь острова Котлин в " +
            "Финском заливе, на котором расположен город Кронштадт[3].\n" +
            "\n" +
            "Авторы ставили целью создать язык более лаконичный и типобезопасный, чем Java, и более простой," +
            " чем Scala[3]. Следствием упрощения по сравнению со Scala стали также более быстрая компиляция и " +
            "лучшая поддержка языка в IDE[4]. Язык полностью совместим с Java, что позволяет java-разработчикам " +
            "постепенно перейти к его использованию; в частности, в Android язык встраивается с помощью Gradle, " +
            "что позволяет для существующего android-приложения внедрять новые функции на Kotlin без " +
            "переписывания приложения целиком.";

    static String java_descr = "Java[прим. 1] — строго типизированный объектно-ориентированный язык программирования, " +
            "разработанный компанией Sun Microsystems (в последующем приобретённой компанией Oracle). " +
            "Разработка ведётся сообществом, организованным через Java Community Process, язык и основные " +
            "реализующие его технологии распространяются по лицензии GPL. Права на торговую марку принадлежат " +
            "корпорации Oracle.\n" +
            "\n" +
            "Приложения Java обычно транслируются в специальный байт-код, поэтому они могут работать на любой " +
            "компьютерной архитектуре с помощью виртуальной Java-машины. Дата официального выпуска — 23 мая 1995 года. " +
            "На 2019 год Java — один из самых популярных языков программирования[2][3].";

    static String python_descr = "Python[комм 2] (в русском языке распространено название пито́н[10]) — высокоуровневый " +
            "язык программирования общего назначения, ориентированный на повышение производительности разработчика" +
            " и читаемости кода. Синтаксис ядра Python минималистичен. В то же время стандартная библиотека включает " +
            "большой объём полезных функций.";

    static String cpp_descr = "C++ (читается си-плюс-плюс[1][2]) — компилируемый, статически типизированный " +
            "язык программирования общего назначения.\n" +
            "\n" +
            "Поддерживает такие парадигмы программирования, как процедурное программирование, " +
            "объектно-ориентированное программирование, обобщённое программирование. Язык имеет " +
            "богатую стандартную библиотеку, которая включает в себя распространённые контейнеры и " +
            "алгоритмы, ввод-вывод, регулярные выражения, поддержку многопоточности и другие возможности. " +
            "C++ сочетает свойства как высокоуровневых, так и низкоуровневых языков.[3][4] В сравнении " +
            "с его предшественником — языком C, — наибольшее внимание уделено поддержке " +
            "объектно-ориентированного и обобщённого программирования.[4]";

    static String csharp_descr = "C# (произносится си шарп) — объектно-ориентированный язык программирования. " +
            "Разработан в 1998—2001 годах группой инженеров компании Microsoft под руководством " +
            "Андерса Хейлсберга и Скотта Вильтаумота[5] как язык разработки приложений для " +
            "платформы Microsoft .NET Framework. Впоследствии был стандартизирован " +
            "как ECMA-334 и ISO/IEC 23270.";

    static String pascal_descr = "PascalABC.NET — язык программирования Паскаль нового поколения, " +
            "включающий классический Паскаль, большинство возможностей языка Delphi, " +
            "а также ряд собственных расширений. Он реализован на платформе Microsoft.NET и " +
            "содержит все современные языковые средства: классы, перегрузку операций, интерфейсы, " +
            "обработку исключений, обобщенные классы и подпрограммы, сборку мусора, лямбда-выражения, " +
            "средства параллельного программирования.";
}
